tutorials/multiphase/multiphaseEulerFoam/damBreak4phase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
     water
     {
         nu         1e-06;
         kappa      1e-06;
         Cp         4195;
         rho        1000;

         diameterModel constant;
         constantCoeffs
         {
             d               1e-3;
         }
     }

     oil
     {
         nu         1e-06;
         kappa      1e-06;
         Cp         4195;
         rho        500;

         diameterModel constant;
         constantCoeffs
         {
             d               1e-3;
         }
     }

     mercury
     {
         nu         1.125e-07;
         kappa      1e-06;
         Cp         4195;
         rho        13529;

         diameterModel constant;
         constantCoeffs
         {
             d               1e-3;
         }
     }

     air
     {
         nu         1.48e-05;
         kappa      2.63e-2;
         Cp         1007;
         rho        1;

         diameterModel constant;
         constantCoeffs
         {
             d               1e-3;
         }
     }
);

sigmas
(
    (air water)     0.07
    (air oil)       0.07
    (air mercury)   0.07
    (water oil)     0.07
    (water mercury) 0.07
    (oil mercury)   0.07
);

interfaceCompression
(
    (air water)     1
    (air oil)       1
    (air mercury)   1
    (water oil)     0
    (water mercury) 0
    (oil mercury)   0
);

virtualMass
(
    (air water)     0.5
    (air oil)       0.5
    (air mercury)   0.5
    (water oil)     0.5
    (water mercury) 0.5
    (oil mercury)   0.5
);

drag
(
    (air water)
    {
        type SchillerNaumann;
        residualDrag 100;
    }

    (air oil)
    {
        type SchillerNaumann;
        residualDrag 100;
    }

    (air mercury)
    {
        type SchillerNaumann;
        residualDrag 100;
    }
);


// This is a dummy to support the Smagorinsky model
transportModel  Newtonian;
nu              nu [ 0 2 -1 0 0 0 0 ] 0;


// ************************************************************************* //
